Repository: ShiZhan/tech-trans-en-zh
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: We can see this trend with the growing revenue of AWS, Microsoft Azure, and Google Compute Engine.
zh_cn: 我们可以看到这样一个趋势，AWS、 微软 Azure 和谷歌计算引擎的收入正不断增长。

source: We once took on strace for all of the applications running on a system and then built a simulation of the combined set of traces and ran this against various storage systems.
zh_cn: 我们曾经用 strace 在系统上采集所有运行于其中的应用程序行为，然后合并这些跟踪，在各种存储系统之上运行仿真。

source: We’re facing a data onslaught like we’ve never seen before.
zh_cn: 我们正面临一场我们从未见过的数据倾泻.

source: What Do You Do With This Information?
zh_cn: 考虑这些情况你当如何处理？

source: What is a Gödel machine?
zh_cn: 什么是哥德尔机？

source: What is different and amazing about this hype cycle is that the doors for building intelligence into everything is being opened up to everyone.
zh_cn: 这种循环激励与众不同和令人惊讶之处在于，其具备为各个方面整合智能性的能力，并将之提供给大众。

source: What's missing and what needs to get done next?
zh_cn: 还缺少什么，以及下一步还需要做什么？

source: Wheat vs chaff
zh_cn: 小麦 对 谷壳

source: Where devices are placed in storage systems is becoming increasingly important, as back ends of storage controllers are not always homogeneous, and high-bandwidth activities such as rebuilding logical unit numbers (LUNs) after failure are bandwidth-hungry activities.
zh_cn: 由于存储控制器的后端设备并不总是同构，设备在存储系统中放置于何处显得越来越重要，而且还要考虑带宽密集型活动，比如出现故障后重建逻辑单元号 (Lun)。

source: While the applications of machine intelligence are many, they aren’t infinite.
zh_cn: 机器智能的应用虽然很丰富，却并非无限。

source: Why now?
zh_cn: 为何是现在？

source: Why storage is getting simpler by ROBIN HARRIS on MONDAY, 2 MAY, 2016
zh_cn: 为什么存储越来越简单 罗宾 · 哈里斯 在星期一 2016 年 5 月 2 日

source: Why TensorFlow will change the Game for AI ­ somatic blog http://www.somatic.io/blog/why­tensorflow­will­change­the­game­for­ai By jason 2016/5/4
zh_cn: 为什么 TensorFlow 将改变 AI 的游戏 - 体细胞博客 http://www.somatic.io/blog/why­tensorflow­will­change­the­game­for­ai 作者 jason 于 2016/5/4

source: Winners will successfully blend ease of use with performance and availability – at a competitive price.
zh_cn: 优胜者将在具有竞争力的价格上成功地融合易用性与性能和可用性。

source: With a huge number of applications all hitting the storage system at once, most believe that I/O at the device level looks to be random because of the way blocks are allocated by file systems at the device.
zh_cn: 若数量庞大的应用程序同时集中访问存储系统，考虑文件系统从设备中分配块的方式，几乎可以确信从设备层面看起来 I/O 就是随机的。

source: With all these new projects and research coming out, more people will be tinkering and building artificial intelligence applications.
zh_cn: 随着这些新项目与研究持续涌现，将有越来越多的人来尝试开发人工智能应用。

source: With disk drives today operating at as much as 305 MB/sec and with SSDs operating at over 1200 MB/sec, SAS performance is now being replaced with NVMe because SAS is not up to the challenge.
zh_cn: 现在的磁盘驱动器工作速度高达 305 MB/秒，而固态盘则超过 1200 MB/秒，由于 SAS 性能难以应对这种挑战，因此 SAS 正在被 NVMe 所取代。

source: With relatively small data sets, the team found that
zh_cn: 在相对较小的数据集上，研究小组发现，

source: With the increase in people building off of TensorFlow, there will need to be a platform for deploying these intelligent programs.
zh_cn: 随着越来越多的人们开始用上 TensorFlow，需要有个平台来部署这些应用程序。

source: With the release of TensorFlow, expect to see an increase in machine learning research.
zh_cn: 随着 TensorFlow 的发布，有望进一步推动机器学习方向上的研究。

source: With the release of TensorFlow, innovation in artificial intelligence will dramatically increase.
zh_cn: 随着 TensorFlow 的发布，人工智能上的革新将飞速发展。

source: Yes, TensorFlow already makes it easy to deploy on your own hardware, but that is still not easy enough.
zh_cn: 没错，TensorFlow 已经使在自己的机器上部署变得容易，然而这还不够。

source: Yes.
zh_cn: 没错。

source: You do not need a PhD in math or computer science to be able to participate in this AI revolution.
zh_cn: 而这，并不需要你拥有一个数学或者计算机科学博士学位，来参与这个人工智能革命。

source: [Original Post](http://storagemojo.com/2016/01/13/godel-machines-deep-learning-and-the-limits-of-ai/)
zh_cn: [原文](http://storagemojo.com/2016/01/13/godel-machines-deep-learning-and-the-limits-of-ai/)

source: [Original Post](http://storagemojo.com/2016/03/21/integrating-3d-xpoint-with-dram/)
zh_cn: [原文](http://storagemojo.com/2016/03/21/integrating-3d-xpoint-with-dram/)

source: [Original Post](http://storagemojo.com/2016/04/15/smart-storage-for-big-data/)
zh_cn: [原文](http://storagemojo.com/2016/04/15/smart-storage-for-big-data/)

source: [Original Post](https://github.com/frankmcsherry/blog/blob/master/posts/2015-12-24.md)
zh_cn: [原文](https://github.com/frankmcsherry/blog/blob/master/posts/2015-12-24.md)

source: “Machine learning is a core, transformative way by which we’re rethinking everything we’re doing.” — Google CEO, Sundar Pichai
zh_cn: "机器学习是核心，是一种全新的方式，我们籍此重新思考着我们正在做的一切"— — 谷歌首席执行官，Sundar Pichai
